Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: In some cases, this might not be the margin you want (e.g. A had a 100dp margin to the side of its container, B only a 16dp to A, marking A as gone, B will have a margin of 16dp to the container).
zh_cn: 在某些情况下，该 margin 可能不是你想要的 margin(比如 A 距容器边有 100dp 的 margin，B 对 A 只有 16dp 的 margin，当 A 标记为 GONE 时，B 对容器有 16dp 的 margin)。

source: In such a case, the screen may seem to be frozen, or to have stopped responding to input.
zh_cn: 在这种情况下，屏幕似乎被冻结，或者已经停止响应输入。

source: In such a situation, the column will change its size to always use up the available space, but never more.
zh_cn: 在这种情况下，列将更改其大小以始终耗尽可用空间，但永远不会更多。

source: In that case the intermediary can check, inbetween the bounds decode and the image decode, to see if the operation is canceled.
zh_cn: 在这种情况下，中介可以在边界解码和图像解码之间检查操作是否被取消。

source: In that case, adapter may choose to recycle it.
zh_cn: 在这种情况下，适配器可能会选择回收它。

source: In that instance, when the pixels need to be accessed again (e.g. the bitmap is drawn, getPixels() is called), they will be automatically re-decoded.
zh_cn: 在这种情况下，当像素需要再次访问时（例如绘制位图，调用 getPixels()），它们将被自动重新解码。

source: In the PieChart example, onSizeChanged() is where the PieChart view calculates the bounding rectangle of the pie chart and the relative position of the text label and other visual elements.
zh_cn: 在 PieChart 示例中，onSizeChanged() 是 PieChart view 计算饼图的边界矩形的位置，文本标签和其他视觉元素的相对位置。

source: In the Component Tree window, right-click the layout and click Convert layout to ConstraintLayout.
zh_cn: 在 Component Tree 窗口，右击布局然后点击 Convert layout to ConstraintLayout。

source: In the Project window, click the module folder and then select File > New > XML > Layout XML.
zh_cn: 在 Project 窗口，点击 module 文件夹，然后选择 File > New > XML > Layout XML。

source: In the API Demos project that comes with the SDK, there are two List examples — Example 4 and Example 6 under Views/Lists demonstrate a SpeechView which extends LinearLayout to make a component for displaying Speech quotes.
zh_cn: 在与 SDK 一起的 API 示例项目中，有两个 List 例子——在 Views/Lists 中的 Example 4 和 Example 6 演示了一个继承 LinearLayout 来显示 Speech quotes 的 SpeechView。

source: In the Javadoc comments, describe what the class or interface does.
zh_cn: 在 Javadoc 备注中说明类或接口的作用。

source: In the NotePad example, the custom component is used directly from the declarative layout, so take a look at note_editor.xml in the res/layout folder.
zh_cn: 在 NotePad 示例中，自定义组件直接从声明性布局中使用，因此请查看 res/layout 文件夹中的 note_editor.xml。

source: In the case of extending a Layout, you don't need to override the onDraw() and onMeasure() methods since the layout will have default behavior that will likely work just fine.
zh_cn: 在继承 Layout 的情况下，你不必重写 onDraw() 或 onMeasure() 方法，因为 layout 有自己的默认行为可以很好的工作。

source: In the case of spread chains, margins will be deducted from the allocated space.
zh_cn: 在展开的链情况下，margin 将被从分配的空间中扣除。

source: In the constructor for the new class, take whatever parameters the superclass expects, and pass them through to the superclass constructor first.
zh_cn: 在新类的构造方法中，首先取出父类需要的参数，通过父类的构造的方法传递给它。

source: In the end, you can very quickly construct arbitrarily complex compound views and re-use them as if they were a single component.
zh_cn: 最后，你可以任意组合和复用复杂的组件，只需把它们当作一个单一的组件。

source: In the event that no weights are specified, the previous conventions are respected and columns and rows are taken as flexible if their views specify some form of alignment within their groups.
zh_cn: 如果未指定权重，则遵循先前的约定，并且如果列和行的 view 在其组中指定某种形式的对齐，则列和行将被视为灵活。

source: In the extreme case, a virtual machine that has no stack trace information concerning this thread is permitted to return a zero-length array from this method.
zh_cn: 在极端情况下，允许没有关于该线程的堆栈跟踪信息的虚拟机从该方法返回零长度数组。

source: In the following example, both views will be created using the Material dark color scheme; however, because an overlay theme is used which only defines a subset of attributes, the value of android:colorAccent defined on the inflation context's theme (e.g. the Activity theme) will be preserved.
zh_cn: 在下面的例子中，两个 view 都将使用 Material dark color 主题创建，然而，因为所使用的覆盖主题只定义了属性的一个子集，在加载的 context 主题(如 Activity 主题)中定义的 android:colorAccent 将被保留。

source: In the following example, modifying the currently selected pie slice in PieChart causes the entire chart to rotate so that the selection pointer is centered in the selected slice.
zh_cn: 在以下示例中，修改 PieChart 中当前选定的饼图切片会导致整个图表旋转，以使选择指针在所选切片中居中。

source: In the future an explicit call to set the capacity should turn off this aggressive shrinking behavior.
zh_cn: 在将来，一个设置容量的显式调用应该会关闭这种激进的收缩行为。

source: In the latter case, once the user picks the file your app can return its content URI.
zh_cn: 在后一种情况下，一旦用户选择文件，你的应用程序可以返回其内容的 URI。

source: In the other states, the system needs to bring the running app from the background to the foreground.
zh_cn: 在其他状态下，系统需要将正在运行的应用程序从后台带到前台。

source: In the rare cases where caching layers are useful, such as for alpha animations, setLayerType(int, android.graphics.Paint) handles this with hardware rendering.
zh_cn: 在极少数情况下，缓存层很有用，例如 alpha 动画，setLayerType(int, android.graphics.Paint) 通过硬件渲染处理此问题。

source: In the same application, the "dialog_exit" ID is compared when creating a dialog:
zh_cn: 在同一个应用程序中，创建对话框时会比较 "dialog_exit" ID：

source: In the stock Android UI this is the space for the system bar, nav bar, and status bar, but not more transient elements such as an input method.
zh_cn: 在 Android UI 中，这是系统栏，导航栏和状态栏的空间，但不是更多的瞬态元素，如输入法。

source: In the toolbar or sync notification, click Sync Project with Gradle Files.
zh_cn: 在工具栏或同步通知中，点吉 Sync Project with Gradle Files。

source: In the top image, the dotted grey lines identify the regions of the image that will be replicated in order to stretch the image.
zh_cn: 在上方的图中，灰色的虚线标明了为拉伸图片将被复制的区域。

source: In these cases you may catch generic Exception (or Throwable) and handle the error appropriately.
zh_cn: 在这些情况下，你可以捕获常规异常(或 Throwable)并适当地处理错误。

source: In these situations, you can provide explicit overrides by using these XML attributes in the layout file:
zh_cn: 在这些情况下，你可以通过在布局文件中使用这些 XML 属性来提供显式重写：

source: In this case however, there is no guarantee that children will not themselves overlap after the layout operation completes.
zh_cn: 但是，在这种情况下，无法保证在布局操作完成后子项本身不会重叠。

source: In this case it is appropriate but not required to print a short log message from the finalizer, as long as it is not expected to flood the logs.
zh_cn: 这种情况下，可以（但并非必须）在终结器中输出简短的日志消息，前提是不会输出大量日志消息。

source: In this case the system sets the largest dimensions the satisfies all constraints and maintains the aspect ratio specified.
zh_cn: 这这种情况下，系统设置满足所有约束的最大尺寸，并保持指定的宽高比。 。

source: In this case, as well, both method tracing and inline tracing can prove useful.
zh_cn: 在这种情况下，方法跟踪和内联跟踪都可以证明是有用的。

source: In this case, the first time measurement is only for the activity that was first drawn.
zh_cn: 在这种情况下，第一个时间量仅适用于首次绘制的 activity。

source: In this case, the item is eventually recycled by ItemAnimatorRestoreListener#onAnimationFinished.
zh_cn: 在本例中，项最终由 ItemAnimatorRestoreListener#onAnimationFinished 回收。

source: In this document
zh_cn: 本文档导航

source: In this example, there is only one method to be overridden: onDraw() — but there could easily be others needed when you create your own custom components.
zh_cn: 在例子中，只需要重写一个方法：onDraw()——但当你创建自己的自定义组件时，你也可以很轻松地重写其他需要的方法。

source: In this implementation, PieChart attempts to make its area big enough to make the pie as big as its label:
zh_cn: 在此实现中，PieChart 尝试使其区域足够大，使得饼与其标签一样大：

source: In this paper, the authors describe 12 compositing operators that govern how to compute the color resulting of the composition of a source (the graphics object to render) with a destination (the content of the render target).
zh_cn: 在本文中，作者描述了 12 个合成操作符，这些操作符管理如何计算源(要渲染的图形对象)与目标(渲染目标的内容)的组合颜色结果。

source: Inappropriate uses of SlidingPaneLayout include switching between disparate functions of your app, such as jumping from a social stream view to a view of your personal profile - cases such as this should use the navigation drawer pattern instead.
zh_cn: SlidingPaneLayout 的不当使用包括在你的应用程序的不同功能之间切换，例如从社交流 view 跳转到你的个人配置文件的 view - 这样的情况应该使用导航抽屉模式。

source: Inches - Based on the physical size of the screen.
zh_cn: Inches（英寸） - 基于屏幕的物理尺寸。

source: Increasing values result in clockwise rotation from the viewpoint of looking down the x axis.
zh_cn: 增加值会导致顺时针旋转（从俯视 x 轴的视角来看）。

source: Increasing values result in clockwise rotation.
zh_cn: 增加值会导致顺时针旋转。

source: Increasing values result in counter-clockwise rotation from the viewpoint of looking down the y axis.
zh_cn: 增加值会导致逆时针旋转（从俯视 y 轴的视角来看）。

source: Indeterminate Progress
zh_cn: 不确定进度

source: Indeterminate mode is the default for progress bar and shows a cyclic animation without a specific amount of progress indicated.
zh_cn: 不确定模式是进度条的默认模式，并显示没有指定特定进度的循环动画。

source: Index 0 corresponds to dx and index 1 corresponds to dy.
zh_cn: 索引 0 对应于 dx，索引 1 对应于 dy。

source: Indicates no axis of view scrolling.
zh_cn: 表示没有滚动轴。

source: Indicates scrolling along the horizontal axis.
zh_cn: 表示沿水平轴滚动。

source: Indicates scrolling along the vertical axis.
zh_cn: 表示沿垂直轴滚动。

source: Indicates that the screen has changed state and is now off.
zh_cn: 表示屏幕已更改状态，现在已关闭。

source: Indicates that the screen has changed state and is now on.
zh_cn: 表示屏幕已更改状态，现在处于打开状态。

source: Indicates that the view does not have a layer.
zh_cn: 表示 view 没有图层。

source: Indicates that the view has a hardware layer.
zh_cn: 表示 view 具有硬件层。

source: Indicates that the view has a software layer.
zh_cn: 表示 view 具有软件层。

source: Indicates that this list will always be drawn on top of solid, single-color opaque background.
zh_cn: 表示此列表将始终在实心的单色不透明背景上绘制。

source: Indicates the initial checked state of this text.
zh_cn: 指示此文本的初始选中状态。

source: Indicates to accessibility services whether the user should be notified when this view changes.
zh_cn: 向可访问性服务指示在此 view 更改时是否应通知用户。

source: Indicates whether each item in the data set can be represented with a unique identifier of type java.lang.Long.
zh_cn: 指示数据集中的每个项是否可以用 java.lang.Long 类型的唯一标识符表示。

source: Indicates whether horizontal (when the orientation is vertical) or vertical (when orientation is horizontal) strokes automatically define a gesture.
zh_cn: 指示水平(当方向是垂直时)还是垂直(当方向是水平时)笔划自动定义手势。

source: Indicates whether some other object is "equal to" this one.
zh_cn: 指示其他某个对象是否 "等于" 这一个。

source: Indicates whether the drawer can be opened/closed by a single tap on the handle.
zh_cn: 指示是否可以通过手柄上的单击来打开/关闭抽屉。

source: Indicates whether the drawer should be opened/closed with an animation when the user clicks the handle.
zh_cn: 指示当用户单击手柄时是否应使用动画打开/关闭抽屉。

source: Indicator shown beside the child View.
zh_cn: 子 view 旁边显示的指示符。

source: Indicator shown beside the group View.
zh_cn: 组 view 旁边显示的指示器。

source: Infer Constraints scans the layout to determine the most effective set of constraints for all views.
zh_cn: Infer Constraints 扫描布局以确定所有 view 的最有效的约束集合。

source: Inflate a menu resource into this toolbar.
zh_cn: 将菜单资源加载到此工具栏中。

source: Inflate an XML menu resource into this toolbar.
zh_cn: 将 XML 菜单资源加载到此工具栏中。

source: Inflate the layout.
zh_cn: 填充布局。

source: Inflating large or complex layouts.
zh_cn: 加载大型或复杂的布局。

source: Inflating views.
zh_cn: 加载 views.

source: Information about an encoded image.
zh_cn: 有关编码图像的信息。

source: Information about an interrupted decode.
zh_cn: 有关中断解码的信息。

source: Information about protected content must definitely be avoided.
zh_cn: 且必须避免提供有关受保护内容的信息。

source: Inherited XML attributes
zh_cn: 继承的 XML 属性

source: Inherited constants
zh_cn: 继承的常量

source: Inherited methods
zh_cn: 继承的方法

source: Initial values for consumed[0] and consumed[1] will always be 0.
zh_cn: consumed[0] 和 consumed[1] 的初始值始终为 0。

source: Initialization of other subsystems of the activity.
zh_cn: 初始化 activity 的其他子系统。

source: Initialize the objects.
zh_cn: 初始化对象。

source: Initializes values.
zh_cn: 初始化值。

source: Inline tracing
zh_cn: 内联跟踪

source: Input is provided to matchers via the CharSequence interface in order to support matching against characters from a wide variety of input sources.
zh_cn: 通过 CharSequence 接口将输入提供给匹配器，以支持从多种输入源到字符的匹配。

source: Insets define the minimum margin for these components and can be used to effectively align Toolbar content along well-known gridlines.
zh_cn: 内缩定义了这些组件的最小边距，可用于有效地将工具栏内容与众所周知的网格线对齐。

source: Inside an XML layout, SlidingDrawer must define the id of the handle and of the content:
zh_cn: 在 XML 布局中，SlidingDrawer 必须定义句柄和内容的 id：

source: Instances of the Matcher class are used to match character sequences against a given pattern.
zh_cn: Matcher 类的实例用于用给定的模式匹配字符序列。

source: Instances of this class are not safe for use by multiple concurrent threads.
zh_cn: 此类的实例用于多个并发线程是不安全的。

source: Instead list view requests views on demand from a ListAdapter as needed, such as to display new views as the user scrolls up or down.
zh_cn: 而是列表 view 根据需要从 ListAdapter 按需请求 view，例如在用户向上或向下滚动时显示新 view。

source: Instead of belonging to the http://schemas.android.com/apk/res/android namespace, they belong to http://schemas.android.com/apk/res/[your package name].
zh_cn: 它们不属于 http://schemas.android.com/apk/res/android 命名空间，而属于 http://schemas.android.com/apk/res/[your package name]。

source: Instead of using PNG or JPEG files, you can also use the WebP file format for your images, when targeting Android 3.2 (API level 13) and higher.
zh_cn: 在针对 Android 3.2(API 级别 13)及更高版本时，你还可以使用 WebP 文件格式代替使用 PNG 或 JPEG 文件。

source: Instead use "match constraints" (0dp).
zh_cn: 而是使用 "match constraints" (0dp)。

source: Instead use app:backgroundTint.
zh_cn: 而是使用 app:backgroundTint。

source: Instead, clients of this API should set up an View#setOnClickListener(OnClickListener) to handle zoom functionality.
zh_cn: 相反，此 API 的客户端应设置 View#setOnClickListener(OnClickListener) 以处理缩放功能。

source: Instead, favor the more flexible approach when writing your own app: use a more generic Activity subclass or Fragment subclass and add a list view to the layout or view hierarchy directly.
zh_cn: 相反，在编写自己的应用程序时支持更灵活的方法：使用更通用的 Activity 子类或 Fragment 子类，并直接向布局或 view 层次结构添加列表 view。

source: Instead, images should move from one place to another.
zh_cn: 相反，图像应该从一个地方移动到另一个地方。

source: Instead, it adds padding to avoid such intersection (See setPreventCornerOverlap(boolean) to change this behavior).
zh_cn: 相反，它添加 padding 以避免这种交集(请参阅 setPreventCornerOverlap(boolean) 以更改此行为)。

source: Instead, it is expected to return an already created View that can be re-used for the given type and position.
zh_cn: 相反，它应该返回一个已经创建的 view，该 view 可以用于给定的类型和位置。

source: Instead, it sets their sizes directly according to its own custom layout algorithm.
zh_cn: 相反，它根据自己的自定义布局算法直接设置它们的大小。

source: Instead, pass the AttributeSet to obtainStyledAttributes().
zh_cn: 取而代之的是，将 AttributeSet 传递给 obtainStyledAttributes()。

source: Instead, the method communicates its results by calling setMeasuredDimension().
zh_cn: 相反，该方法通过调用 setMeasuredDimension() 来传达其结果。

source: Instead, use ValueAnimator to make the change.
zh_cn: 而是使用 ValueAnimator 进行更改。

source: Instead, use use a ViewStub object as a placeholder for sub-hierarchies that the app can inflate at a more appropriate time.
zh_cn: 相反，使用 ViewStub 对象作为子层次结构的占位符，应用程序可以在更合适的时间加载。

source: Instead, you can include a FileProvider in your app by specifying it entirely in XML.
zh_cn: 相反，你可以在应用程序中包含 FileProvider，方法是将其完全指定为 XML。

source: Instead, you can use content padding attributes in XML or setContentPadding(int, int, int, int) in code to set the padding between the edges of the CardView and children of CardView.
zh_cn: 相反，你可以在 XML 中使用 content padding 属性或在代码中使用 setContentPadding(int, int, int, int) 来设置 CardView 边缘和 CardView 子项之间的 padding。

source: Instead, you should return a pre-allocated list that will be cleared after the dispatch is finished.
zh_cn: 相反，你应该返回一个预先分配的列表，该列表将在分派完成后被清除。

source: Instead, you should use AnimatedVectorDrawableCompat to create animated vector drawables.
zh_cn: 相反，你应该使用 AnimatedVectorDrawableCompat 来创建 animated vector drawables。

source: Interaction behavior plugin for child views of CoordinatorLayout.
zh_cn: CoordinatorLayout 子 view 的交互行为插件。

source: Interface definition for a callback to be invoked when a MaterialButton is checked or unchecked in this group.
zh_cn: 在此组中选中或取消选中 MaterialButton 时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when a captured pointer event is being dispatched this view.
zh_cn: 在为此 view 调度捕获的指针事件时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when a child in this expandable list has been clicked.
zh_cn: 单击此可展开列表中的子项时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when a drag is being dispatched to this view.
zh_cn: 将拖动分发到此 view 时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when a generic motion event is dispatched to this view.
zh_cn: 将通用运动事件分发到此 view 时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when a group in this expandable list has been clicked.
zh_cn: 单击此可展开列表中的组时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when a hardware key event hasn't been handled by the view hierarchy.
zh_cn: 当 view 层次结构未处理硬件按键事件时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when a hardware key event is dispatched to this view.
zh_cn: 将硬件按键事件分发到此 view 时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when a hover event is dispatched to this view.
zh_cn: 将悬停事件分发到此 view 时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when a touch event is dispatched to this view.
zh_cn: 将触摸事件分发到此 view 时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when a view has been clicked and held.
zh_cn: 单击并按住 view 时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when a view is clicked.
zh_cn: 单击 view 时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when a view is context clicked.
zh_cn: 在单击上下文 view 时调用的回调的接口定义。

source: Interface definition for a callback to be invoked when an AppBarLayout's vertical offset changes.
zh_cn: 当 AppBarLayout 的垂直偏移发生变化时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when an item in this AdapterView has been clicked.
zh_cn: 单击此 AdapterView 中的项目时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when an item in this view has been clicked and held.
zh_cn: 单击并保持此 view 中的项目时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when an item in this view has been selected.
zh_cn: 选择此 view 中的项目时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when tab changed
zh_cn: 更改选项卡时要调用的回调的接口定义

source: Interface definition for a callback to be invoked when the button checked state changes.
zh_cn: 当按钮选中状态更改时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when the card checked state changes.
zh_cn: 卡检查状态更改时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when the checked chip changed in this group.
zh_cn: 当已选中的 chip 在此组中更改时，将调用的回调的接口定义。

source: Interface definition for a callback to be invoked when the checked radio button changed in this group.
zh_cn: 当在此组中更改了选中的单选按钮时，将调用的回调的接口定义。

source: Interface definition for a callback to be invoked when the checked state of a compound button changed.
zh_cn: 复合按钮的选中状态更改时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when the context menu for this view is being built.
zh_cn: 正在构建此 view 的上下文菜单时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when the focus state of a view changed.
zh_cn: 当 view 的焦点状态发生更改时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when the hierarchy within this view changed.
zh_cn: 当此 view 中的层次结构发生更改时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when the layout bounds of a view changes due to layout processing.
zh_cn: 当 view 的布局边界由于布局处理而发生更改时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when the list or grid has been scrolled.
zh_cn: 滚动列表或网格时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when the scroll X or Y positions of a view change.
zh_cn: 当 view 的滚动 X 或 Y 位置发生更改时，将调用的回调的接口定义。

source: Interface definition for a callback to be invoked when the status bar changes visibility.
zh_cn: 状态栏更改可见性时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when the unhandled input event is received.
zh_cn: 接收未处理的输入事件时要调用的回调的接口定义。

source: Interface definition for a callback to be invoked when this view is attached or detached from its window.
zh_cn: 从该窗口附加或分离此 view 时要调用的回调的接口定义。

source: Interface for changing the default settings of a decode.
zh_cn: 用于更改解码默认设置的接口。

source: Interface for inspecting a DecodeException and potentially preventing it from being thrown.
zh_cn: 用于检查 DecodeException 并可能阻止其被抛出的接口。

source: Interface responsible for receiving menu item click events if the items themselves do not have individual item click listeners.
zh_cn: 如果项目本身没有单独的项目单击侦听器，则负责接收菜单项单击事件的接口。

source: Interface to listen for changes of the current value.
zh_cn: 监听当前值变化的接口。

source: Interface to listen for find results.
zh_cn: 用于监听查找结果的接口。

source: Interface to listen for the picker scroll state.
zh_cn: 用于监听选择器滚动状态的接口。

source: Interface used to format current value into a string for presentation.
zh_cn: 用于将当前值格式化为字符串以进行表示的接口。

source: Interfaces
zh_cn: 接口

source: Interpretation of GONE
zh_cn: 解析 GONE

source: Intersect the two paths.
zh_cn: 交集，两条路径相交。

source: Intially, all of the radio buttons are unchecked.
zh_cn: 初始时，所有单选按钮都未选中。

source: Invalid data coming from any untrusted source (including any file on shared storage, or data coming through just about any network connection) is considered expected and should not trigger any logging at a level higher than DEBUG when it's detected to be invalid (and even then logging should be as limited as possible).
zh_cn: 来自任何不受信任来源(包括共享存储空间中的任何文件或通过任何网络连接获取的数据)的无效数据被视为符合预期，在被检测到无效时不应触发高于 DEBUG 级别的任何日志记录(甚至应该尽可能地限制日志记录)。

source: Invalidates all ItemDecorations.
zh_cn: 使所有 ItemDecorations 无效。

source: Invokes the context menu if the OnLongClickListener did not consume the event, anchoring it to an (x,y) coordinate.
zh_cn: 如果 OnLongClickListener 未消耗该事件，则调用上下文菜单，将其锚定到 (x,y) 坐标。

source: Invokes the context menu if the OnLongClickListener did not consume the event.
zh_cn: 如果 OnLongClickListener 未消耗该事件，则调用上下文菜单。

source: Issues that justify some logging at the ERROR level are typically good candidates to be reported to a statistics-gathering server.
zh_cn: 一般情况下，最好向统计信息收集服务器报告能够说明 ERROR 级别的一些日志记录情况的问题。

source: Issues that justify some logging at the WARNING level might also be considered for reporting to a statistics-gathering server.
zh_cn: 可以考虑向统计信息收集服务器报告能够说明 WARNING 级别的一些日志记录情况的问题。

source: It also helps with performance because all view bindings happen at the same time and unnecessary bindings are avoided.
zh_cn: 这样做也可以帮助提升性能，因为所有的 view 的绑定同时发生，并且避免了不必要的绑定。

source: It also includes the start and end indices of the input subsequence captured by each capturing group in the pattern as well as a total count of such subsequences.
zh_cn: 它还包括模式中每个 capturing group 捕获的输入子序列的开始和结束索引以及该子序列的总数。

source: It begins by explaining the internals of the launch process.
zh_cn: 它首先解释了启动过程的内部结构。

source: It can also be tempting to be lazy when catching exceptions and do something like this:
zh_cn: 在捕获异常时，开发者可能会为了偷懒而倾向于采用以下处理方式：

source: It can also compute differences with SortedList.replaceAll(Object[]), but this method is more limited than the list diffing behavior above.
zh_cn: 它还可以使用 SortedList.replaceAll(Object[]) 计算差异，但此方法比上面的列表差异行为更受限制。

source: It can be done using MenuItem#setChecked(true)
zh_cn: 可以使用 MenuItem#setChecked(true) 来完成
